/*
Прислал Дмитрий Жуков.

Мы создаем игру крестики-нолики. Нам нужно узнать выиграл ли кто-либо. Функция
isSolved должна вернуть:
-1 - если никто не победил и еще остались незаполненные клетки.
0 - если все поле заполнено, никто не победил.
1 - победили "X".
2 - победили "O".
В функцию передается массив, в котором лежит три массива с тремя значениями 
(поле 3х3), где 0 - пустая клетка, 1 - крестик, 2 - нолик.
*/

function isSolved (board) {
    for (let i = 0; i < board.length; i++) {
      for (let j = 0; j < 3; j++) {
        if (board?.[i]?.[j] === 2 && board?.[i]?.[j + 1] === 2 && board?.[i]?.[j + 2] === 2) {
          return 2; // строка
        } else if (board?.[i]?.[j] === 2 && board?.[i + 1]?.[j + 1] === 2 && board?.[i + 2]?.[j + 2] === 2) {
          return 2; // диагональ слева направо
        } else if (board?.[i]?.[j] === 2 && board?.[i + 1]?.[j - 1] === 2 && board?.[i + 2]?.[j - 2] === 2) {
          return 2; // диагональ справа налево
        } else if (board?.[i]?.[j] === 2 && board?.[i + 1]?.[j] === 2 && board?.[i + 2]?.[j] === 2) {
          return 2; // столбец
        }
        
        if (board?.[i]?.[j] === 1 && board?.[i]?.[j + 1] === 1 && board?.[i]?.[j + 2] === 1) {
          return 1; // строка
        } else if (board?.[i]?.[j] === 1 && board?.[i + 1]?.[j + 1] === 1 && board?.[i + 2]?.[j + 2] === 1) {
          return 1; // диагональ слева направо
        } else if (board?.[i]?.[j] === 1 && board?.[i + 1]?.[j] === 1 && board?.[i + 2]?.[j] === 1) {
          return 1; // столбец
        } 
          
        if (board?.[i]?.[2] === 2 && board?.[i + 1]?.[1] === 2 && board?.[i + 2]?.[0] === 2) {
          return 2; // диагональ справа налево
        } else if (board?.[i]?.[2] === 1 && board?.[i + 1]?.[1] === 1 && board?.[i + 2]?.[0] === 1) {
          return 1; // диагональ справа налево
        } else {
          return -1;
        }
      }
    }
  }
  
  console.log(isSolved(
    [[0, 2, 1],
     [0, 1, 2],
     [1, 1, 2]])
  ); // 1
  
  console.log(isSolved(
   [[0, 0, 1],
    [0, 1, 2],
    [2, 1, 0]])
  ); // -1
  
  console.log(isSolved(
    [[2, 2, 0],
     [2, 0, 2],
     [2, 1, 2]])
  ); // 2